Seems that this is fixed with some version; when I created this bug only available version of module was 0.1.0, but with 0.3.1 it seems that identity is left uncreated as should.

Test file:
```hcl
provider "azurerm" {
  features {}
}

module "avm-res-containerregistry-registry" {
  source  = "Azure/avm-res-containerregistry-registry/azurerm"
  version = "0.3.1" # or 0.1.0
  location = "westeurope"
  name = "avmbugtest"
  resource_group_name = "rg-bug-test"
  # insert the 3 required variables here
}

```

With 0.1.0 (relevant part)
```
  # module.avm-res-containerregistry-registry.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }
```

With 0.3.1
```
  # module.avm-res-containerregistry-registry.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + anonymous_pull_enabled        = false
      + data_endpoint_enabled         = false
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "avmbugtest"
      + network_rule_bypass_option    = "None"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + quarantine_policy_enabled     = false
      + resource_group_name           = "rg-bug-test"
      + retention_policy              = [
          + {
              + days    = 7
              + enabled = false
            },
        ]
      + sku                           = "Premium"
      + trust_policy                  = [
          + {
              + enabled = false
            },
        ]
      + zone_redundancy_enabled       = true
    }
```